name: "blip_vqa_visual_encoder"
backend: "python"

max_batch_size: 0

input [
  {
    name: "INPUT0"
    data_type: TYPE_FP32
    dims: [-1, 3, 480, 480 ]
  }
]
output [
  {
    name: "OUTPUT0"
    data_type: TYPE_FP32
    dims: [-1, 901, 768 ]
  }
]

instance_group [{ kind: KIND_GPU, gpus:[0] }]
