name: "blip_vqa_visual_encoder"
backend: "python"

max_batch_size: 128

dynamic_batching {
    max_queue_delay_microseconds: 100
}

input [
  {
    name: "INPUT0"
    data_type: TYPE_STRING
    dims: [-1]
  }
]
output [
  {
    name: "OUTPUT0"
    data_type: TYPE_FP32
    dims: [ -1, -1, -1 ]
  }
]

instance_group [{ kind: KIND_GPU, gpus:[0] }]
